.config/doom/config.el

(use-package! org-roam
  :custom
  (org-roam-directory "~/org/roam")
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n")
      :unnarrowed t)
     ("p" "project" entry (file "~/org/roam/templates/project-capture.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
      :unnarrowed t)))
  :config
  (org-roam-db-autosync-mode))

(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
          (seq-filter
           (my/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun my/org-roam-refresh-agenda-list ()
  (interactive)
  (let* ((current-files org-agenda-files)
         (new-files (my/org-roam-list-notes-by-tag "Project"))
         (all-files (delete-dups (append current-files new-files))))
    (setq org-agenda-files all-files)))
;; Build the agenda list the first time for the session
(my/org-roam-refresh-agenda-list)

(defun my/org-roam-project-finalize-hook ()
  "Adds the captured project file to `org-agenda-files' if the
capture was not aborted."
  ;; Remove the hook since it was added temporarily
  (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

  ;; Add project file to the agenda list if the capture was confirmed
  (unless org-note-abort
    (with-current-buffer (org-capture-get :buffer)
      (add-to-list 'org-agenda-files (buffer-file-name)))))

(defun my/org-roam-find-project ()
  (interactive)
  ;; Add the project file to the agenda after capture is finished
  (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

  ;; Select a project file to open, creating it if necessary
  (org-roam-node-find
   nil
   nil
   (my/org-roam-filter-by-tag "Project")
   nil
   :templates
   '(("p" "project" entry (file "~/org/roam/templates/project-capture.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
      :unnarrowed t)
     )))
(defun my/org-roam-capture-task ()
  (interactive)
  ;; Add the project file to the agenda after capture is finished
  (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

  ;; Capture the new task, creating the project file if necessary
  (org-roam-capture- :node (org-roam-node-read
                            nil
                            (my/org-roam-filter-by-tag "Project"))
                     :templates '(("p" "project" plain "** TODO %?"
                                   :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                          "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                          ("Tasks"))))))

(map! :leader
      (:prefix "n r"
       :desc "insert node immediate" "I" #'org-roam-node-insert-immediate
       :desc "find Project node" "p" #'my/org-roam-find-project
       :desc "capture Task to Project" "t" #'my/org-roam-capture-task))

(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner redo" "<right>" #'winner-redo
       :desc "Winner undo" "<left>"  #'winner-undo))

(after! clojure-mode
  (add-hook 'clojure-mode-hook #'enable-paredit-mode))

(after! lsp-mode
  ;; https://github.com/emacs-lsp/lsp-mode/issues/3577#issuecomment-1709232622
  (delete 'lsp-terraform lsp-client-packages))

(use-package! kubernetes
  :ensure t
  :commands (kubernetes-overview)
  :config
  (setq kubernetes-poll-frequency 3600
        kubernetes-redraw-frequency 3600))
(use-package! kubernetes-evil
  :defer
  :after kubernetes)
(map! :leader
      (:prefix "o"
        :desc "Kubernetes" "k" 'kubernetes-overview))

(after! lsp-mode
  (setq lsp-pylsp-plugins-flake8-enabled t)
  (setq lsp-pylsp-plugins-pylint-enabled t)
  (setq lsp-pylsp-plugins-pycodestyle-enabled t)
  (setq lsp-pylsp-plugins-pydocstyle-enabled t)
  (setq lsp-pylsp-plugins-autopep8-enabled t))

(use-package! python
  :config
  (setq python-shell-interpreter "python3")
  (setq python-indent-guess-indent-offset-verbose nil)
  (setq python-indent-guess-indent-offset t)
  (setq python-indent-offset 4))

(use-package! python-black
  :after python
  :config
  (setq python-black-command "black"))

(map! :after python
      :map python-mode-map
      :leader
      :desc "Format buffer with Black" "=" #'python-black-buffer)

(use-package! dap-mode
  :after lsp-mode
  :config
  (require 'dap-python)
  (setq dap-python-debugger 'debugpy))

(add-hook! 'python-mode-hook #'lsp!)

(require 'dap-dlv-go)

;; Ensure protobuf-mode is used for .proto files
(add-to-list 'auto-mode-alist '("\\.proto\\'" . protobuf-mode))

;; Add the buf language server
(use-package! lsp-mode
  :ensure t
  :commands lsp
  :hook (protobuf-mode . lsp)
  :config
  ;; Register buf-language-server with lsp-mode
  (add-to-list 'lsp-language-id-configuration '(protobuf-mode . "protobuf"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection "/home/erfan/.local/share/go/bin/bufls")
                    :major-modes '(protobuf-mode)
                    :server-id 'bufls)))

(setq evil-want-minibuffer t)

(use-package! evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(add-to-list 'auto-mode-alist '("\\.m\\'" . octave-mode))

(setq-default fill-column 120)

(defun erfan/enable-column-indicator-for-code ()
  (when (derived-mode-p 'prog-mode 'text-mode)
    (display-fill-column-indicator-mode 1)))

(add-hook 'after-change-major-mode-hook #'erfan/enable-column-indicator-for-code)

(setq lsp-auto-guess-root t)
(setq lsp-guess-root-without-session t)

(after! go-mode
  (set-formatter! 'golangci-lint "golangci-lint run --fix")
  (setq flycheck-go-golangci-lint-executable "golangci-lint")
  (add-hook 'go-mode-hook (lambda ()
                            (setq flycheck-disabled-checkers '(go-build go-test go-errcheck go-vet))
                            (flycheck-golangci-lint-setup))))
